{
  "pr_number": 618,
  "changes": [
    {
      "change": "Changes",
      "description": "Updated all database interactions to use SQLAlchemy's asyncio extension. The engine, session maker and session have been replaced by their async variants, and the helper methods for interacting with the database have all been updated to use async/await. This means that we can now write asynchronous code for read, write, update and delete, which should allow the server itself to handle more requests at once."
    },
    {
      "change": "Changes",
      "description": "The helper methods for creating and updating objects now return the formatted object instead of the raw SQLAlchemy object."
    },
    {
      "change": "Features",
      "description": "Added a logger to the Database Handler class and added logging for all errors raised by the database."
    },
    {
      "change": "Chores",
      "description": "Replaced psycopg2 with asyncpg as the driver used for database interactions, as psycopg2 doesn't support async/await."
    },
    {
      "change": "Changes",
      "description": "Changed several relationships (user relationship in posts; role relationship in users; and permission relationship in roles) to use eager loading using 'selectin' instead of the default lazy loading. The SQLAlchemy asyncio extension doesn't support accessing attributes of lazily-loaded objects, and all three attributes are required to return the formatted versions of the models they're defined in (post, user and role respectively)."
    },
    {
      "change": "Fixes",
      "description": "Dates are now explicitly parsed from strings passed into the API (using `strptime`) and strings that contain integers (e.g., IDs) are explicitly cast from strings to integers. This fixes an issue where inserts and queries errored due to the wrong type being used for dates/IDs."
    },
    {
      "change": "Changes",
      "description": "Changed the name of the Quart app from the current file's name to `SendAHug` to better reflect the server's purpose."
    }
  ]
}
